app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dfsd"], ["room_number", 0], ["created_at", "2018-03-18 06:27:48.457846"], ["updated_at", "2018-03-18 06:27:48.457846"]]
---
  def create
    school_class = SchoolClass.create(post_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", nil], ["room_number", nil], ["updated_at", "2018-03-18 06:40:20.187423"], ["id", 8]]
---
  def update
    school_class = SchoolClass.find(params[:id])
    school_class.update(post_params)